---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoofLevelOffsetParam
source: html/3cf616a4-1d0c-a568-f6df-cf505563f1e2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoofLevelOffsetParam Property

"Base Offset From Level"

## Syntax (C#)
```csharp
public static ForgeTypeId RoofLevelOffsetParam { get; }
```